; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l22_p22_c22_g22)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 comida)
	(at-box box19 deposito)
	(box-has box19 comida)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-person person1 refugio10)
	(at-person person2 refugio7)
	(at-person person3 refugio22)
	(at-person person4 refugio20)
	(at-person person5 refugio20)
	(at-person person6 refugio15)
	(at-person person7 refugio17)
	(at-person person8 refugio1)
	(at-person person9 refugio17)
	(at-person person10 refugio8)
	(at-person person11 refugio4)
	(at-person person12 refugio10)
	(at-person person13 refugio16)
	(at-person person14 refugio11)
	(at-person person15 refugio1)
	(at-person person16 refugio6)
	(at-person person17 refugio14)
	(at-person person18 refugio20)
	(at-person person19 refugio6)
	(at-person person20 refugio16)
	(at-person person21 refugio4)
	(at-person person22 refugio4)
)

(:goal (and
	(person-has person1 comida)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person5 comida)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 medicina)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person12 comida)
	(person-has person13 comida)
	(person-has person14 comida)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person19 comida)
	(person-has person20 comida)
	(person-has person21 comida)
))
)

; plan
1. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 0 of 22
2. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 0 of 22
3. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 0 of 22
4. (leave box19 refugio22 dron1-izq dron1 person3 comida)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 comida)
   added: (at-box box19 refugio22) (free dron1-izq) (person-has person3 comida)
   goals met: 1 of 22
5. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 1 of 22
6. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 1 of 22
7. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 1 of 22
8. (leave box18 refugio15 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 comida)
   added: (at-box box18 refugio15) (free dron1-izq) (person-has person6 comida)
   goals met: 2 of 22
9. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 2 of 22
10. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 2 of 22
11. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 2 of 22
12. (move refugio17 refugio11 dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 refugio11)
   goals met: 2 of 22
13. (leave box17 refugio11 dron1-izq dron1 person14 comida)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 comida)
   added: (at-box box17 refugio11) (free dron1-izq) (person-has person14 comida)
   goals met: 3 of 22
14. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 3 of 22
15. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 3 of 22
16. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 3 of 22
17. (move refugio17 refugio14 dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 refugio14)
   goals met: 3 of 22
18. (leave box16 refugio14 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 comida)
   added: (at-box box16 refugio14) (free dron1-izq) (person-has person17 comida)
   goals met: 4 of 22
19. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 4 of 22
20. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 4 of 22
21. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 4 of 22
22. (leave box15 refugio17 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 comida)
   added: (at-box box15 refugio17) (free dron1-izq) (person-has person7 comida)
   goals met: 5 of 22
23. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 5 of 22
24. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 5 of 22
25. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 5 of 22
26. (leave box22 refugio17 dron1-der dron1 person7 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio17) (free dron1-der) (person-has person7 medicina)
   goals met: 6 of 22
27. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 6 of 22
28. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 6 of 22
29. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 6 of 22
30. (leave box21 refugio17 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio17) (free dron1-der) (person-has person9 medicina)
   goals met: 7 of 22
31. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 7 of 22
32. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 7 of 22
33. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 7 of 22
34. (leave box20 refugio8 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio8) (free dron1-der) (person-has person10 medicina)
   goals met: 8 of 22
35. (leave box14 refugio8 dron1-izq dron1 person10 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio8) (free dron1-izq) (person-has person10 comida)
   goals met: 9 of 22
36. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 9 of 22
37. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 9 of 22
38. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 9 of 22
39. (leave box13 refugio10 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio10) (free dron1-der) (person-has person1 comida)
   goals met: 10 of 22
40. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 10 of 22
41. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 10 of 22
42. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 10 of 22
43. (leave box12 refugio10 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio10) (free dron1-der) (person-has person12 comida)
   goals met: 11 of 22
44. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 11 of 22
45. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 11 of 22
46. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 11 of 22
47. (leave box11 refugio1 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio1) (free dron1-der) (person-has person8 comida)
   goals met: 12 of 22
48. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 12 of 22
49. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 12 of 22
50. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 12 of 22
51. (leave box10 refugio1 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio1) (free dron1-der) (person-has person15 comida)
   goals met: 13 of 22
52. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 13 of 22
53. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 13 of 22
54. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 13 of 22
55. (leave box9 refugio20 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio20) (free dron1-der) (person-has person4 comida)
   goals met: 14 of 22
56. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 14 of 22
57. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 14 of 22
58. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 14 of 22
59. (leave box8 refugio20 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio20) (free dron1-der) (person-has person5 comida)
   goals met: 15 of 22
60. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 15 of 22
61. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 15 of 22
62. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 15 of 22
63. (leave box7 refugio20 dron1-der dron1 person18 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio20) (free dron1-der) (person-has person18 comida)
   goals met: 16 of 22
64. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 16 of 22
65. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 16 of 22
66. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 16 of 22
67. (leave box6 refugio6 dron1-der dron1 person16 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio6) (free dron1-der) (person-has person16 comida)
   goals met: 17 of 22
68. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 17 of 22
69. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 17 of 22
70. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 17 of 22
71. (leave box5 refugio6 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio6) (free dron1-der) (person-has person19 comida)
   goals met: 18 of 22
72. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 18 of 22
73. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 18 of 22
74. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 18 of 22
75. (leave box4 refugio16 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio16) (free dron1-der) (person-has person13 comida)
   goals met: 19 of 22
76. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 19 of 22
77. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 19 of 22
78. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 19 of 22
79. (leave box3 refugio16 dron1-der dron1 person20 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio16) (free dron1-der) (person-has person20 comida)
   goals met: 20 of 22
80. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 20 of 22
81. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 20 of 22
82. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 20 of 22
83. (leave box2 refugio4 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio4) (free dron1-der) (person-has person11 comida)
   goals met: 21 of 22
84. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 21 of 22
85. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 21 of 22
86. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 21 of 22
87. (leave box1 refugio4 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio4) (free dron1-der) (person-has person21 comida)
   goals met: 22 of 22
